PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
/***************************************************************************//**
* \file cy_autanalog_ac.h
* \version 2.0
*
* Header file for the Autonomous Controller (AC) subsystem of the Autonomous Analog.
*
********************************************************************************
* \copyright
* Copyright 2023-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_autanalog_ac
* \{
* This driver provides API functions to configure the Autonomous Controller (AC) subsystem within the Autonomous Analog.
*
* The AC controls the entire operation of the Autonomous Analog. This includes enabling/disabling analog blocks,
* configuring them using the dynamic part of the configuration, checking state/status and handling events by
* taking conditional actions, managing intermediate data and notifying the host MCU/peripheral using interrupts/triggers.
*
* The diagram below shows the AC simplified internals.
*
* \image html LPPASS_AC_General.png
*
* For more information on the AC,
* refer to the device Architecture Technical Reference Manual (TRM).\n
* For the exact location of the digital outputs pins, see the device datasheet.
*
* \section group_autanalog_ac_stt State Transition Table
*
* The AC FSM is based on a sequencer that can operate in all power modes except Hibernate.
* The set of operating states for this sequencer is named the State Transition Table (STT).
* The total number of the states in the STT is 64. The STT of Autonomous Analog is defined by \ref cy_stc_autanalog_stt_t
* and illustrated on the diagram below.
*
* \image html LPPASS_STT.png
*
* The AC part of the STT (STT AC) is configured with \ref cy_stc_autanalog_stt_ac_t and described below.
* The STTs for other subsystems are described in the relevant chapter for each subsystem.
*
* In each state of the STT, the AC interacts with other subsystems of the Autonomous Analog via a standard interface
* (see \ref group_autanalog_ac_interface chapter). This interaction includes receiving the subsystem status and
* issuing the appropriate action (if any), see \ref group_autanalog_ac_cond_act chapter.
*
* The AC can change the STT state sequentially or take branch conditionally,
* depending on events from the subsystems of the Autonomous Analog.
*
* \subsection group_autanalog_ac_interface AC Interface
*
* The AC has a standard interface for each sub-system of the Autonomous Analog:
* - Enable sub-system (used to enable/disable, gate resets/clocks, and power analog macros)\n
*   e.g. \ref cy_stc_autanalog_stt_ctb_t::enableOpamp0 for the CTB;
* - Static Configuration Selection for channel selection (to sub-systems like the ADC and DAC)\n
*   e.g. \ref cy_stc_autanalog_stt_dac_t::channel for the DAC;
* - Dynamic Configuration Selection for routing and/or gain (for sub-systems like the PTComp and CTB)\n
*   e.g. \ref cy_stc_autanalog_stt_ptcomp_t::dynCfgIdxComp0;
* - Condition(s) (varies per sub-system)
*   e.g. \ref cy_en_autanalog_stt_ac_condition_t::CY_AUTANALOG_STT_AC_CONDITION_SAR_DONE;
* - Action Trigger(s) (internal triggers for the clocked sub-systems like the ADC and DAC)
*   e.g. \ref cy_stc_autanalog_stt_sar_t::trigger;
*
* The subsystems provide their interfaces for the AC in the \ref cy_stc_autanalog_stt_t configuration structure.
* The complete STT configuration contains the total number of states used in the STT (\ref cy_stc_autanalog_t::numSttEntries)
* and a pointer to the array of configured interfaces of that size (\ref cy_stc_autanalog_t::stateTransitionTable).
*
* \subsection group_autanalog_ac_cond_act AC Conditions and Actions
*
* The CONDITION events (\ref cy_en_autanalog_stt_ac_condition_t) are statuses from the sub-systems of the Autonomous Analog
* for the AC that can be used to branch (\ref cy_en_autanalog_stt_ac_action_t) the program execution (i.e. change the STT state)
* and/or triggering an appropriate action for the subsystem (e.g. cy_stc_autanalog_stt_dac_t::trigger).
*
* \section group_autanalog_ac_tc AC Loop/Interval Counters
*
* The AC contains four Loop/Interval counters that are programmatically assigned to the STT states. These down counters are
* used by the AC to implement delays in a given STT state (interval) or loop constructions that may contain several
* STT states. The AC can support up to 4 loop counters, or up to 3 loop counters and 1 interval counter. The counters periods are
* programmed with \ref cy_stc_autanalog_stt_ac_t::count. Every AC clock cycle (see \ref group_autanalog_ac_clock chapter),
* the counter value decrements. When the counter value reaches zero (terminal count), the counter asserts a CNT_DONE trigger
* that is read by the AC.
*
* The current state of the Loop/Interval Counter represents \ref cy_stc_autanalog_state_tc_t configuration structure.
*
* \subsection group_autanalog_ac_lc Loop Counters
*
* The loop counters are used for repeating certain STT states for a finite number of times. The user requests a
* Loop Counter by programming a particular STT state with the BRANCH_IF_* action and CNT_DONE condition.
*
* \note When programming the AC to jump back to a particular state,\n
* it is recommended to use ACTION = BRANCH_IF_TRUE/BRANCH_IF_TRUE_CLR, CONDITION = TRUE.\n
* Avoid using ACTION = BRANCH_IF_FALSE/BRANCH_IF_FALSE_CLR, CONDITION = FALSE,\n
* as it could may cause unexpected issues.
*
* \subsection group_autanalog_ac_ic Interval Counter
*
* The interval counters are used for waiting in a particular STT state for a finite amount of time. The user requests an
* Interval Counter by programming a particular STT state with the WAIT_FOR action and CNT_DONE condition.
*
* \section group_autanalog_ac_state AC State
*
* The current AC state represents the \ref cy_stc_autanalog_state_ac_t configuration structure.
*
* \section group_autanalog_aa_state Autonomous Analog State
*
* The current Autonomous Analog state represents the \ref cy_stc_autanalog_state_t configuration structure.
*
* \section group_autanalog_ac_mode High Speed and Low Power operation
*
* The AC is available in both High Speed (HS) and Low Power (LP) modes. The operational mode of the AC determines the
* actual operation mode for the entire Autonomous Analog block (see \ref cy_stc_autanalog_stt_ac_t::lpMode).
*
* \section group_autanalog_ac_clock AC Clock
*
* In HS mode, the AC is clocked from CLK_HF9 directly (80MHz max) and functions only in chip Active mode.\n
* In LP mode, the AC is clocked from CLK_LPOSC (4.096MHz nominal) and functions in chip Active and Deep Sleep modes.
*
* \section group_autanalog_ac_pm Power Management
*
* In LP mode, the AC uses a dedicated logic for the Autonomous Analog digital logic duty cycling and minimizing both
* switching and leakage currents.
*
* \subsection group_autanalog_ac_dc Duty Cycling
*
* The AC requests a duty cycling event based on the programming of the ACTION and CONDITION
* (\ref cy_en_autanalog_stt_ac_action_t and \ref cy_en_autanalog_stt_ac_condition_t). Whenever the AC state is programmed with
* WAIT_FOR action and *_WAKEUP condition, a sleep request is sent to the duty cycle FSM.
*
* For configuration settings, see the \ref cy_stc_autanalog_stt_t configuration structure and refer to \ref group_autanalog_ac_stt
* chapter for more information.
*
* \subsection group_autanalog_ac_wakeup Wake-up Events and Wake-up Timer
*
* The duty cycling FSM supports several different wake-up sources:
* - Wake-up Timer;
* - See the rest of *_WAKEUP conditions in \ref cy_en_autanalog_stt_ac_condition_t;
*
* The wake-up Timer can be clocked from the 32kHz low frequency clock (CLK_LF) or
* (at the expense of additional switching current) the 4.096MHz low power oscillator (CLK_LPOSC).
*
* For configuration settings, see the \ref cy_stc_autanalog_timer_t configuration structure.
*
* \section group_autanalog_ac_cfg AC Configuration
*
* The AC configuration includes:
* - Wake-up timer (\ref group_autanalog_ac_wakeup chapter);
* - Enable the control a set of digital outputs (\ref group_autanalog_ac_dout chapter);
* - The set of masks to control output triggers (\ref group_autanalog_ac_trigg chapter);
*
* For configuration settings, see the \ref cy_stc_autanalog_ac_t configuration structure.
*
* \section group_autanalog_ac_dout AC Digital Outputs
*
* Four GPIOs can be directly controlled by the AC (\ref cy_stc_autanalog_stt_ac_t::gpioOut) in runtime. Before using this option,
* they must be enabled in the AC configuration (\ref cy_stc_autanalog_ac_t::gpioOutEn) and unlocked for a given state in the
* State Transition Table (\ref cy_stc_autanalog_stt_ac_t::unlockGpioOut). The digital waveforms are constructed based on the
* duration of a current state in the State Transition Table (\ref group_autanalog_ac_stt) and the order of state execution.
*
* For more details, refer to the \ref group_autanalog_ac_cfg and \ref group_autanalog_ac_stt chapters.
*
* \section group_autanalog_ac_trigg External Triggers
*
* The trigger is the method to start the activity in a given chip block without MCU intervention.
* The AC supports four (hardware/firmware) input triggers and eight (\ref cy_en_autanalog_ac_out_trigger_idx_t) output triggers.
*
* \subsection group_autanalog_ac_in_trigg Input Triggers
*
* The input trigger can be initiated by an event on external block (HW trigger) or from the API (FW trigger, \ref cy_en_autanalog_fw_trigger_t).
*
* \subsection group_autanalog_ac_fw_trigg Firmware Triggers
*
* The AC can use the FW triggers as the CONDITIONS (*_TR_AUTANALOG_IN*, \ref cy_en_autanalog_stt_ac_condition_t) for
* the available ACTIONS (\ref cy_en_autanalog_stt_ac_action_t).
*
* For more details about the AC CONDITIONS and ACTIONS, refer to the \ref group_autanalog_ac_cond_act chapter.
*
* The FW trigger can be issued by means of the provided API, \ref Cy_AutAnalog_FwTrigger.
*
* \subsection group_autanalog_ac_out_trigg Output Triggers
*
* The output trigger can be initiated in response to an event within the Autonomous Analog. The set of such events is defined in
* \ref cy_en_autanalog_ac_out_trigger_mask_t. The required output triggers must be enabled in the AC configuration structure
* (\ref cy_stc_autanalog_ac_t::mask). Also, you can modify them at runtime using the provided API.
* \ref Cy_AutAnalog_GetOutputTriggerMask, \ref Cy_AutAnalog_SetOutputTriggerMask.
*
* \defgroup group_autanalog_ac_macros Macros
* \defgroup group_autanalog_ac_functions Functions
* \defgroup group_autanalog_ac_data_structures Data Structures
* \defgroup group_autanalog_ac_enums Enumerated Types
*/

#if !defined(CY_AUTANALOG_AC_H)
#define CY_AUTANALOG_AC_H

