PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
#include "cy_autanalog_common.h"

#ifdef CY_IP_MXS22LPPASS

#include "cy_syspm.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_autanalog_ac_macros
* \{
*/

/** The maximum number of states in the State Transition Table (STT),
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_STATE_TRANSITION_TABLE_STATES_NUM           (64U)

/** The maximum number of Loop/Interval counters that can be used by the AC,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_TC_NUM                                      (4U)

/** The maximum number of output triggers for the AC,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_TRIG_OUT_NUM                                (8U)

/** \cond INTERNAL */

/* Validation macro for State Transition Table register of AC */
#define AUTANALOG_STT_AC_CFG0_DOUT(value)                        ((value) <= ACTRLR_TTCFG_TT_CFG0_DOUT_Msk)

/* The SysPm callback structure */
extern cy_stc_syspm_callback_t deepSleepCallback;

/** \endcond */

/** \} group_autanalog_ac_macros */

/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_autanalog_ac_enums
* \{
*/

/** The AC operation status, see \ref cy_stc_autanalog_state_ac_t::status,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_AC_STATUS_STOPPED = 0UL, /**< The AC is idle */
    CY_AUTANALOG_AC_STATUS_RUNNING = 1UL, /**< The AC is running */
    CY_AUTANALOG_AC_STATUS_PAUSED  = 2UL, /**< The AC is paused */

} cy_en_autanalog_ac_status_t;


/**
* The set of masks to control the four GPIO outputs with the AC, see \ref cy_stc_autanalog_ac_t::gpioOutEn,
* for more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_STT_AC_GPIO_OUT_DISABLED = 0x0UL, /**< Control of the GPIO outs is disabled */
    CY_AUTANALOG_STT_AC_GPIO_OUT0         = 0x1UL, /**< The GPIO out0 */
    CY_AUTANALOG_STT_AC_GPIO_OUT1         = 0x2UL, /**< The GPIO out1 */
    CY_AUTANALOG_STT_AC_GPIO_OUT2         = 0x4UL, /**< The GPIO out2 */
    CY_AUTANALOG_STT_AC_GPIO_OUT3         = 0x8UL, /**< The GPIO out3 */

} cy_en_autanalog_stt_ac_gpio_out_t;


/**
* The set of ACTIONS for the AC to change the STT state,
* for more details, refer to the device Architecture Technical Reference Manual,
* \ref group_autanalog_ac_stt chapter and \ref cy_stc_autanalog_stt_ac_t::condition field in the AC STT.
*/
typedef enum
{
    CY_AUTANALOG_STT_AC_ACTION_STOP                = 0UL,  /**< Stop the AC */
    CY_AUTANALOG_STT_AC_ACTION_NEXT                = 1UL,  /**< Proceed to the next state in the STT */
    CY_AUTANALOG_STT_AC_ACTION_WAIT_FOR            = 2UL,  /**< Wait (indefinitely) for the associated CONDITION
                                                            *   to be TRUE before moving to the next state,
                                                            *   see \ref cy_stc_autanalog_stt_ac_t::condition */
    CY_AUTANALOG_STT_AC_ACTION_BRANCH_IF_TRUE      = 3UL,  /**< Check if CONDITION has occurred
                                                            *   If it occurred, take the indicated branch
                                                            *   \ref cy_stc_autanalog_stt_ac_t::branchState,
                                                            *   if not, proceed to the next state */
    CY_AUTANALOG_STT_AC_ACTION_BRANCH_IF_FALSE     = 4UL,  /**< Check if CONDITION has occurred
                                                            *   If it occurred, proceed to the next state,
                                                            *   if not, take the indicated branch
                                                            *   \ref cy_stc_autanalog_stt_ac_t::branchState
                                                            *   \note When programming the AC to jump back to a particular state,
                                                            *   it is recommended to use ACTION = BRANCH_IF_TRUE, CONDITION = TRUE.
                                                            *   Avoid using ACTION = BRANCH_IF_FALSE, CONDITION = FALSE,
                                                            *   as it could may cause unexpected issues. */
    CY_AUTANALOG_STT_AC_ACTION_BRANCH_IF_TRUE_CLR  = 5UL,  /**< Check if CONDITION has occurred
                                                            *   If it occurred, take the indicated branch
                                                            *   \ref cy_stc_autanalog_stt_ac_t::branchState,
                                                            *   if not, proceed to the next state
                                                            *   \note If the indicated branch is taken,
                                                            *   all loop counters are cleared (reset).
                                                            *   \note If the CONDITION is set to CNT_DONE,
                                                            *   (\ref cy_en_autanalog_stt_ac_condition_t)
                                                            *   then the loop counters are not cleared (reset). */
    CY_AUTANALOG_STT_AC_ACTION_BRANCH_IF_FALSE_CLR = 6UL,  /**< Check if CONDITION has occurred
                                                            *   If it occurred proceed to the next state,
                                                            *   if not, take the indicated branch.
                                                            *   \note If the indicated branch is taken,
                                                            *   all loop counters are cleared (reset).
                                                            *   \note If the CONDITION is set to CNT_DONE,
                                                            *   (\ref cy_en_autanalog_stt_ac_condition_t)
                                                            *   then the loop counters are not cleared (reset).
                                                            *   \note When programming the AC to jump back to a particular state,
                                                            *   it is recommended to use ACTION = BRANCH_IF_TRUE_CLR, CONDITION = TRUE.
                                                            *   Avoid using ACTION = BRANCH_IF_FALSE_CLR, CONDITION = FALSE,
                                                            *   as it could may cause unexpected issues. */
} cy_en_autanalog_stt_ac_action_t;


