PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
/**
* The set of CONDITIONS (events) for the AC to change the STT state,
* for more details, refer to the device Architecture Technical Reference Manual,
* \ref group_autanalog_ac_stt chapter and \ref cy_stc_autanalog_stt_ac_t::condition field in the AC STT.
*/
typedef enum
{
    CY_AUTANALOG_STT_AC_CONDITION_FALSE                = 0UL,  /**< Unconditionally FALSE */
    CY_AUTANALOG_STT_AC_CONDITION_TRUE                 = 1UL,  /**< Unconditionally TRUE */
    CY_AUTANALOG_STT_AC_CONDITION_BLOCK_READY          = 2UL,  /**< Enabled subsystems of the Autonomous Analog
                                                                *   are initialized and ready for use */
    CY_AUTANALOG_STT_AC_CONDITION_CNT_DONE             = 3UL,  /**< Run-out for an interval timer
                                                                *   if the ACTION is WAIT_FOR,
                                                                *   or run-out for a loop counter,
                                                                *   if the ACTION is BRANCH IF
                                                                *   (\ref cy_en_autanalog_stt_ac_action_t) */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_DONE             = 4UL,  /**< SAR Sequencer DONE.
                                                                *   This status is sticky.
                                                                *   It is set by the SAR when finishing a state
                                                                *   in the SAR sequencer table (HS/LP) where NEXT_STATE
                                                                *   cy_stc_autanalog_sar_seq_tab_hs_t::nextAction or
                                                                *   cy_stc_autanalog_sar_seq_tab_lp_t::nextAction
                                                                *   is set to STOP.
                                                                *   Do not use this field if the SAR is configured
                                                                *   for CONTINUOUS operation
                                                                *   (i.e. NEXT_STATE is set to GO_TO_ENTRY_ADDRESS,
                                                                *   see \ref cy_en_autanalog_sar_next_act_t).\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to
                                                                *      WAIT_FOR or BRANCH_IF_* and CONDITION is set to SAR_DONE.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR
                                                                *      and CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the SAR, see
                                                                *       \ref cy_stc_autanalog_stt_sar_t::enable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple SAR_DONEs).\n
                                                                *   \note This status does NOT indicate that the SAR data
                                                                *   has been written to the FIFO (indicated by SAR_FIFO_DONE). */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_EOS              = 5UL,  /**< SAR End of Scan (EOS).
                                                                *   This status is sticky.
                                                                *   It is set by the SAR when finishing the state
                                                                *   in the SAR sequencer table (HS/LP) NEXT_STATE
                                                                *   cy_stc_autanalog_sar_seq_tab_hs_t::nextAction or
                                                                *   cy_stc_autanalog_sar_seq_tab_lp_t::nextAction
                                                                *   is set to GO_TO_ENTRY_ADDRESS or STOP,
                                                                *   see \ref cy_en_autanalog_sar_next_act_t.
                                                                *   The status is cleared by the AC when executing an AC state
                                                                *   with the CONDITION programmed to SAR_EOS.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACT is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and COND is set to SAR_EOS.
                                                                *   2. Executing an AC state where ACT is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the SAR, see
                                                                *      \ref cy_stc_autanalog_stt_sar_t::enable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple SAR_EOSs). */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_RANGE0           = 6UL,  /**< SAR Range 0 detection.
                                                                *   This status is sticky.
                                                                *   It is set by the SAR if the RANGE0 condition is met
                                                                *   for a given channel with range 0 status enabled:
                                                                *   cy_stc_autanalog_sar_mux_chan_t::muxLimit
                                                                *   is equal to CY_AUTANALOG_SAR_LIMIT_STATUS_STC0 for LP/HS modes
                                                                *   OR cy_stc_autanalog_sar_hs_chan_t::hsLimit
                                                                *   is equal to CY_AUTANALOG_SAR_LIMIT_STATUS_STC0 for HS mode.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to
                                                                *      WAIT_FOR or BRANCH_IF_* and CONDITION is set to SAR_RANGE0.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR
                                                                *      and CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the SAR, see
                                                                *      \ref cy_stc_autanalog_stt_sar_t::enable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple SAR_RANGE0s). */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_RANGE1           = 7UL,  /**< SAR Range 1 detection. It is similar to range 0 detection. */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_RANGE2           = 8UL,  /**< SAR Range 2 detection. It is similar to range 0 detection. */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_RANGE3           = 9UL,  /**< SAR Range 3 detection. It is similar to range 0 detection. */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_BUSY             = 10UL, /**< SAR BUSY detection.
                                                                *   This status is set whenever the SAR is running a scan.
                                                                *   This status is transparent from the SAR sequencer
                                                                *   (i.e. the status is not sticky). */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_FIR0_DONE        = 11UL, /**< SAR FIR0 done detection.
                                                                *   This status is sticky.
                                                                *   It is set by the SAR FIR0 block whenever FIR0
                                                                *   produces a valid output.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to SAR_FIR0_DONE.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the SAR, see
                                                                *      \ref cy_stc_autanalog_stt_sar_t::enable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple SAR_FIR0_DONEs).
                                                                *   \note This status does NOT indicate that the FIR0 data has been
                                                                *   written to the FIFO (indicated by SAR_FIR0_FIFO_DONE).*/
    CY_AUTANALOG_STT_AC_CONDITION_SAR_FIR1_DONE        = 12UL, /**< SAR FIR1 done detection. It is similar to FIR0 done detection. */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_FIFO_DONE        = 13UL, /**< SAR FIFO done.
                                                                *   This status is SAR_DONE ANDED with FIFO writing complete.
                                                                *   Do not use this field if the SAR is configured for
                                                                *   for CONTINUOUS operation
                                                                *   (i.e. NEXT_STATE is set to GO_TO_ENTRY_ADDRESS,
                                                                *   see \ref cy_en_autanalog_sar_next_act_t)
                                                                *   since SAR_DONE is never asserted.
                                                                *   In that case, use the appropriate
                                                                *   FIFO_LEVEL triggers.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to SAR_FIFO_DONE.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the SAR, see
                                                                *      \ref cy_stc_autanalog_stt_sar_t::enable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple SAR_FIFO_DONEs).
                                                                *   \note This status does NOT indicate that the SAR data has been
                                                                *   written to the FIFO (indicated by SAR_FIFO_DONE). */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_FIR0_FIFO_DONE   = 14UL, /**< SAR FIR0 FIFO done detection.
                                                                *   This status is sticky.
                                                                *   It is set by the SAR FIR0 block whenever FIR0 data has been
                                                                *   written into the FIFO. When using this bit, it is expected that
                                                                *   FIR0 writes to the FIFO only once in a given SAR scan.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to SAR_FIR0_FIFO_DONE.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the SAR, see
                                                                *      \ref cy_stc_autanalog_stt_sar_t::enable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple SAR_FIR0_FIFO_DONEs). */
    CY_AUTANALOG_STT_AC_CONDITION_SAR_FIR1_FIFO_DONE   = 15UL, /**< SAR FIR1 FIFO done detection. It is similar to
                                                                *   SAR FIR0 FIFO done detection. */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_STROBE0       = 16UL, /**< PTComp Post Processor 0 Strobe.
                                                                *   This status is set whenever the PTComp Post Processor 0
                                                                *   has valid data. This status is transparent from the PTComp
                                                                *   post processor (i.e. the status is not sticky).
                                                                *   The AC needs to poll this status
                                                                *   (i.e. ACTION is WAIT_FOR and CONDITION is PTCOMP_STROBE0)
                                                                *   prior to checking PTC_RANGE0. */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_STROBE1       = 17UL, /**< PTComp Post Processor 1 Strobe.
                                                                    It is similar to PTComp Post Processor 0 Strobe. */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_CMP0          = 18UL, /**< PTComp COMP0 output.
                                                                *   This status is sticky.
                                                                *   It is set by the PTComp Comparator 0 if the condition is met.
                                                                *   (\ref Cy_AutAnalog_PTComp_Read).
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to PTCOMP_CMP0.
                                                                *   2. Executing an AC state where ACT is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5.  Disabling PTComp comparator 0
                                                                *       (by clearing cy_stc_autanalog_stt_ptcomp_t::enableComp0)
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple PTC_CMP0s). */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_CMP1          = 19UL, /**< PTComp COMP1 output. It is similar to PTComp COMP1 output. */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_RANGE0        = 20UL, /**< PTComp Post Processor 0 Range output.
                                                                *   This status is sticky.
                                                                *   It is set by the PTComp Post Processor if the RANGE0 condition
                                                                *   is met (\ref cy_stc_autanalog_ptcomp_comp_pp_t::limitCondition).
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITIN is set to PTCOMP_RANGE0.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling both PTComp comparators (by clearing
