PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
                                                                *      cy_stc_autanalog_stt_ptcomp_t::enableComp0 and
                                                                *      cy_stc_autanalog_stt_ptcomp_t::enableComp1)
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple PTCOMP_RANGE0s). */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_RANGE1        = 21UL, /**< PTComp Post Processor 1 Range output. It is similar to
                                                                    PTComp Post Processor 0 Range output. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB0_CMP0            = 22UL, /**< CTB0 COMP0 output.
                                                                *   This status is sticky.
                                                                *   It is set by the CTB0 Opamp0 Comparator if the condition is met
                                                                *   (\ref cy_stc_autanalog_ctb_sta_t::intComp0).\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to CTB0_CMP0.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling CTB0 opamp0
                                                                *      (by clearing cy_stc_autanalog_stt_ctb_t::enableOpamp0)
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple CTB0_CMP0s). */
    CY_AUTANALOG_STT_AC_CONDITION_CTB0_CMP1            = 23UL, /**< CTB0 COMP1 output. It is similar to CTB0 COMP0 output. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB1_CMP0            = 24UL, /**< CTB1 COMP0 output. It is similar to CTB0 COMP0 output. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB1_CMP1            = 25UL, /**< CTB1 COMP1 output. It is similar to CTB0 COMP0 output. */
    CY_AUTANALOG_STT_AC_CONDITION_CHIP_ACTIVE          = 32UL, /**< Chip Active Mode Status.
                                                                *   This status is set whenever the system is operating in
                                                                *   Active Mode (this includes all Low Power active modes)*/
    CY_AUTANALOG_STT_AC_CONDITION_CHIP_DEEPSLEEP       = 33UL, /**< Chip DeepSleep Mode Status.
                                                                *   This status is set whenever the system is operating in
                                                                *   DeepsSeep Mode (this includes all RAM power modes in DeepSleep) */
    CY_AUTANALOG_STT_AC_CONDITION_TR_AUTANALOG_IN0     = 34UL, /**< External trigger 0 (or the FW trigger 0).
                                                                *   This status is sticky.
                                                                *   It is set by the either the external hardware trigger 0 or
                                                                *   FW trigger 0 asserting.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to TR_AUTANALOG_IN0.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   \note No overflow indication is provided for this bit.
                                                                *    Therefore, it is up to the user to program the AC
                                                                *    to read this status before an overflow occurs
                                                                *    (multiple TR_LPPASS_IN0s). */
    CY_AUTANALOG_STT_AC_CONDITION_TR_AUTANALOG_IN1     = 35UL, /**< External trigger 1 (or the FW trigger 1).
                                                                *   It is similar to External trigger 0. */
    CY_AUTANALOG_STT_AC_CONDITION_TR_AUTANALOG_IN2     = 36UL, /**< External trigger 2 (or the FW trigger 2).
                                                                *   It is similar to External trigger 0. */
    CY_AUTANALOG_STT_AC_CONDITION_TR_AUTANALOG_IN3     = 37UL, /**< External trigger 3 (or the FW trigger 3).
                                                                *   It is similar to External trigger 0. */
    CY_AUTANALOG_STT_AC_CONDITION_TR_AUTANALOG_IN_WAKE = 38UL, /**< External Trigger Wake-up Source.
                                                                *   This condition is used to put the AC to sleep.
                                                                *   \note When using this condition,
                                                                *   the ACTION must be set to WAIT_FOR.
                                                                *   The AC will wake up when any external trigger
                                                                *   [0-3] is asserted.
                                                                *   \note When the AC is sleeping,
                                                                *   all registered AC conditions are cleared. */
    CY_AUTANALOG_STT_AC_CONDITION_TIMER_DONE_WAKE      = 39UL, /**< Timer Wakeup Source.
                                                                *   This condition is used to put the AC to sleep.
                                                                *   The AC will wake from sleep when the Wake-up Timer
                                                                *   reaches terminal count (\ref cy_stc_autanalog_state_t::tc).
                                                                *   \note When using this condition,
                                                                *   the ACTION must be set to WAIT_FOR.
                                                                *   The Wake-up Timer must also be configured
                                                                *   (\ref cy_stc_autanalog_ac_t::timer).
                                                                *   \note When the AC is sleeping, all registered AC conditions
                                                                *   are cleared. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB0_CMP0_WAKE       = 40UL, /**< CTB0 comparator 0 wake-up.
                                                                *   This condition is used to put the AC to sleep.
                                                                *   The AC will wake up when CTB0 Comparator 0
                                                                *   meets the configured wake-up condition.
                                                                *   \note When using this condition, the ACTION must be set to
                                                                *   WAIT_FOR. The comparator wake-up condition is configured
                                                                *   per \ref cy_stc_autanalog_ctb_sta_t::intComp0.
                                                                *   The CTB0 comparator 0 must be enabled during sleep
                                                                *   (\ref cy_stc_autanalog_stt_ctb_t::enableOpamp0).
                                                                *   \note When the AC is sleeping, all registered AC conditions
                                                                *   are cleared. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB0_CMP1_WAKE       = 41UL, /**< CTB0 comparator 1 wake-up.
                                                                *   It is similar to CTB0 comparator 0 wake-up. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB1_CMP0_WAKE       = 42UL, /**< CTB1 comparator 0 wake-up.
                                                                *   It is similar to CTB0 comparator 0 wake-up. */
    CY_AUTANALOG_STT_AC_CONDITION_CTB1_CMP1_WAKE       = 43UL, /**< CTB1 comparator 1 wake-up.
                                                                *   It is similar to CTB0 comparator 0 wake-up. */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_CMP0_WAKE     = 44UL, /**< PTComp comparator 0 wake-up.
                                                                *   This condition is used to put the AC to sleep.
                                                                *   The AC will wake up when PTComp Comparator 0
                                                                *   meets the configured wake-up condition.
                                                                *   \note When using this condition, the ACTION must be set to
                                                                *   WAIT_FOR. The comparator wake-up condition is configured
                                                                *   per \ref cy_stc_autanalog_ptcomp_comp_sta_t::compEdgeComp0.
                                                                *   The PTC comparator 0 be enabled during aa sleep
                                                                *   (\ref cy_stc_autanalog_stt_ptcomp_t::enableComp0).
                                                                *   \note When the AC is sleeping, all registered AC conditions
                                                                *   are cleared. */
    CY_AUTANALOG_STT_AC_CONDITION_PTCOMP_CMP1_WAKE     = 45UL, /**< PTComp comparator 1 wake-up.
                                                                *   It is similar to PTComp comparator 0 wake-up. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL0          = 46UL, /**< FIFO Level 0 trigger.
                                                                *   This status is transparent from the FIFO
                                                                *   (i.e. the status is not sticky).
                                                                *   This status is set whenever FIFO0 level condition has been met
                                                                *   (\ref cy_stc_autanalog_fifo_cfg_t::level). */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL1          = 47UL, /**< FIFO Level 1 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL2          = 48UL, /**< FIFO Level 2 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL3          = 49UL, /**< FIFO Level 3 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL4          = 50UL, /**< FIFO Level 4 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL5          = 51UL, /**< FIFO Level 5 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL6          = 52UL, /**< FIFO Level 6 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_FIFO_LEVEL7          = 53UL, /**< FIFO Level 7 trigger.
                                                                *   It is similar to FIFO Level 0 trigger.
                                                                *   \note This status requires that
                                                                *   corresponding buffers be enabled and configured. */
    CY_AUTANALOG_STT_AC_CONDITION_DAC0_RANGE0          = 54UL, /**< DAC0 Range 0 detection.
                                                                *   This status is sticky.
                                                                *   It is set by the DAC0 if the RANGE0 condition is met
                                                                *   for a given channel with range 0 status enabled
                                                                *   (i.e. \ref cy_stc_autanalog_dac_ch_t::statSel).
                                                                *   This status is not used when DAC0 is configured for FW mode.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to
                                                                *      WAIT_FOR or BRANCH_IF_* and CONDITION is set to DAC0_RANGE0.
                                                                *   2. Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5.  Disabling the DAC0
                                                                *       (by clearing \ref cy_stc_autanalog_stt_dac_t::enable).
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple DAC0_RANGE0s). */
    CY_AUTANALOG_STT_AC_CONDITION_DAC0_RANGE1          = 55UL, /**< DAC0 Range 1 detection.
                                                                *   It is similar to DAC0 Range 0 detection */
    CY_AUTANALOG_STT_AC_CONDITION_DAC0_RANGE2          = 56UL, /**< DAC0 Range 2 detection.
                                                                *   It is similar to DAC0 Range 0 detection */
    CY_AUTANALOG_STT_AC_CONDITION_DAC0_EPOCH           = 57UL, /**< DAC0 End of Waveform event.
                                                                *   This status is sticky.
                                                                *   It is set by the DAC when finishing a waveform.
                                                                *   This condition is only used if the DAC channel
                                                                *   (pointed to by the AC when triggered)
                                                                *   is configured for LUT mode.\n
                                                                *   The status is cleared by the AC when any of the following occur:
                                                                *   1. Executing an AC state where ACTION is set to WAIT_FOR or
                                                                *      BRANCH_IF_* and CONDITION is set to DAC0_EPOCH.
                                                                *   2  Executing an AC state where ACTION is set to WAIT_FOR and
                                                                *      CONDITION is set to any of the *_WAKE.
                                                                *   3. Pausing the AC, see
                                                                *      \ref Cy_AutAnalog_PauseAutonomousControl or
                                                                *      \ref Cy_AutAnalog_SingleStepAutonomousControl
                                                                *   4. Disabling the AC, see
                                                                *      \ref Cy_AutAnalog_Disable
                                                                *   5. Disabling the DAC
                                                                *   (by clearing cy_stc_autanalog_stt_dac_t::enable)
                                                                *   \note No overflow indication is provided for this bit.
                                                                *   Therefore, it is up to the user to program the AC
                                                                *   to read this status before an overflow occurs
                                                                *   (multiple DAC0_EPOCHs). */
    CY_AUTANALOG_STT_AC_CONDITION_DAC0_STROBE          = 58UL, /**< DAC0 Strobe.
                                                                *   This status is transparent from the DAC
                                                                *   (i.e. the status is not sticky).
                                                                *   This status is set whenever the DAC output has been updated.
                                                                *   This status is typically used by the AC to poll when the DAC
                                                                *   has responded to the DAC_INC/DAC_DEC fields.\n
                                                                *   \note The AC needs to poll this status
                                                                *   (i.e. ACTION is WAIT_FOR and CONDITION is DAC0_STROBE)
                                                                *   prior to checking DAC_RANGE0 - DAC_RANGE2
                                                                *   or setting DAC_INC/DAC_DEC fields. */
    CY_AUTANALOG_STT_AC_CONDITION_DAC1_RANGE0          = 59UL, /**< DAC1 Range 0 detection.
                                                                *   It is similar to DAC0 Range 0 detection. */
    CY_AUTANALOG_STT_AC_CONDITION_DAC1_RANGE1          = 60UL, /**< DAC1 Range 1 detection.
                                                                *   It is similar to DAC0 Range 1 detection. */
    CY_AUTANALOG_STT_AC_CONDITION_DAC1_RANGE2          = 61UL, /**< DAC1 Range 2 detection.
                                                                *   It is similar to DAC0 Range 2 detection. */
    CY_AUTANALOG_STT_AC_CONDITION_DAC1_EPOCH           = 62UL, /**< DAC1 End of Waveform event.
                                                                *   It is similar to DAC0 End of Waveform event. */
    CY_AUTANALOG_STT_AC_CONDITION_DAC1_STROBE          = 63UL, /**< DAC1 Strobe.
                                                                *   It is similar to DAC0 Strobe. */
} cy_en_autanalog_stt_ac_condition_t;


/** The AC FW input triggers, \ref Cy_AutAnalog_FwTrigger,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_FW_TRIGGER0 = 0UL, /**< FW trigger 0 */
    CY_AUTANALOG_FW_TRIGGER1 = 1UL, /**< FW trigger 1 */
    CY_AUTANALOG_FW_TRIGGER2 = 2UL, /**< FW trigger 2 */
    CY_AUTANALOG_FW_TRIGGER3 = 3UL, /**< FW trigger 3 */

} cy_en_autanalog_fw_trigger_t;


