PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
/**
* The AC output triggers, \ref Cy_AutAnalog_GetOutputTriggerMask and \ref Cy_AutAnalog_SetOutputTriggerMask,
* for more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_AC_OUT_TRIGGER0 = 0UL, /**< Output trigger 0 */
    CY_AUTANALOG_AC_OUT_TRIGGER1 = 1UL, /**< Output trigger 1 */
    CY_AUTANALOG_AC_OUT_TRIGGER2 = 2UL, /**< Output trigger 2 */
    CY_AUTANALOG_AC_OUT_TRIGGER3 = 3UL, /**< Output trigger 3 */
    CY_AUTANALOG_AC_OUT_TRIGGER4 = 4UL, /**< Output trigger 4 */
    CY_AUTANALOG_AC_OUT_TRIGGER5 = 5UL, /**< Output trigger 5 */
    CY_AUTANALOG_AC_OUT_TRIGGER6 = 6UL, /**< Output trigger 6 */
    CY_AUTANALOG_AC_OUT_TRIGGER7 = 7UL, /**< Output trigger 7 */

} cy_en_autanalog_ac_out_trigger_idx_t;


/**
* The set of masks to control the AC output trigger, see \ref cy_stc_autanalog_ac_t::mask and
* \ref Cy_AutAnalog_GetOutputTriggerMask, \ref Cy_AutAnalog_SetOutputTriggerMask.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_AC_OUT_TRIG_MASK_EMPTY         =       0UL,        /**< The output trigger is disabled */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_CTB0_COMP0    =       1UL << 0U,  /**< The CTB0, Comp0 trigger.
                                                                     *   It is generated by the CTB0 Opamp0 Comparator
                                                                     *   if the condition is met
                                                                     *   (i.e. \ref cy_stc_autanalog_ctb_sta_t::intComp0)*/
    CY_AUTANALOG_AC_OUT_TRIG_MASK_CTB0_COMP1    =       1UL << 1U,  /**< The CTB0, Comp1 trigger.
                                                                     *   It is generated by the CTB0 Opamp1 Comparator
                                                                     *   if the condition is met
                                                                     *   (i.e. \ref cy_stc_autanalog_ctb_sta_t::intComp1)*/
    CY_AUTANALOG_AC_OUT_TRIG_MASK_CTB1_COMP0    =       1UL << 2U,  /**< The CTB1, Comp0 trigger.
                                                                     *   It is similar to CTB0, Comp0 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_CTB1_COMP1    =       1UL << 3U,  /**< The CTB1, Comp1 trigger.
                                                                     *   It is similar to CTB1, Comp1 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_PTCOMP_CMP0   =       1UL << 4U,  /**< The PTComp Comp0 trigger.
                                                                     *   It is set by the PTComp Comparator 0
                                                                     *   if the condition is met
                                                                     *   (cy_stc_autanalog_ptcomp_comp_sta_t::compEdgeComp0).*/
    CY_AUTANALOG_AC_OUT_TRIG_MASK_PTCOMP_CMP1   =       1UL << 5U,  /**< The PTComp Comp1 trigger.
                                                                     *   It is similar to PTComp Comp0 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_PTCOMP_RANGE0 =       1UL << 6U,  /**< The PTComp Post Processor 0 Range trigger
                                                                     *   It is generated by the PTComp Post Processor
                                                                     *   if the RANGE0 condition is met
                                                                     *   (\ref cy_stc_autanalog_ptcomp_comp_pp_t::limitCondition) */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_PTCOMP_RANGE1 =       1UL << 7U,  /**< The PTComp Post Processor 1 Range trigger.
                                                                     *   It is similar to PTComp Post Processor 0 Range trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC0_RANGE0   =       1UL << 8U,  /**< The DAC0 Range 0 trigger.
                                                                     *   It is generated by the DAC0 if the RANGE0
                                                                     *   condition is met for a given channel
                                                                     *   with range 0 status enabled
                                                                     *   (\ref cy_stc_autanalog_dac_ch_t::statSel).
                                                                     *   \note The interrupt is disabled when DAC0 is configured
                                                                     *   for FW mode. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC0_RANGE1   =       1UL << 9U,  /**< The DAC0 Range 1 trigger.
                                                                     *   It is similar to DAC0 Range 0 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC0_RANGE2   =       1UL << 10U, /**< The DAC0 Range 2 trigger.
                                                                     *   It is similar to DAC0 Range 0 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC0_EPOCH    =       1UL << 11U, /**< The DAC0 End of Waveform trigger.
                                                                     *   It is generated by DAC0 when finishing a waveform.
                                                                     *   This condition is only used if the DAC0 channel
                                                                     *   (pointed to by the AC when triggered)
                                                                     *   is configured for LUT mode. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC1_RANGE0   =       1UL << 13U, /**< The DAC1 Range 0 trigger.
                                                                     *   It is similar to DAC0 Range 0 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC1_RANGE1   =       1UL << 14U, /**< The DAC1 Range 1 trigger.
                                                                     *   It is similar to DAC0 Range 1 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC1_RANGE2   =       1UL << 15U, /**< The DAC1 Range 2 trigger.
                                                                     *   It is similar to DAC0 Range 2 trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_DAC1_EPOCH    =       1UL << 16U, /**< The DAC1 End of Waveform trigger.
                                                                     *   It is similar to DAC0 End of Waveform trigger. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL0   =       1UL << 17U, /**< The FIFO Level 0 trigger.
                                                                     *   This is a level-sensitive trigger
                                                                     *   that is generated by the FIFO
                                                                     *   whenever FIFO 0 meets the condition
                                                                     *   cy_stc_autanalog_fifo_cfg_t::level */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_SAR_DONE      =       1UL << 18U, /**< The SAR Sequencer Done trigger.
                                                                     *   This trigger is set by the SAR when finishing a state
                                                                     *   in the SAR sequencer table (HS or LP) where
                                                                     *   \ref cy_stc_autanalog_sar_seq_tab_hs_t::nextAction or
                                                                     *   \ref cy_stc_autanalog_sar_seq_tab_lp_t::nextAction
                                                                     *   is set to STOP.
                                                                     *   \note The interrupt is not generated if the SAR
                                                                     *   is configured for CONTINUOUS operation
                                                                     *   (i.e. \ref cy_stc_autanalog_sar_seq_tab_hs_t::nextAction
                                                                     *   or \ref cy_stc_autanalog_sar_seq_tab_lp_t::nextAction
                                                                     *   is set to GO_TO_ENTRY_ADDRESS).
                                                                     *   This trigger does NOT indicate that the SAR data
                                                                     *   has been written to the FIFO
                                                                     *   (use the FIFO level triggers instead). */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_SAR_EOS       =       1UL << 19U, /**< The SAR Sequencer EOS trigger.
                                                                     *   This trigger is set by the SAR when finishing
                                                                     *   the state in the SAR sequencer table (HS or LP) where
                                                                     *   \ref cy_stc_autanalog_sar_seq_tab_hs_t::nextAction or
                                                                     *   \ref cy_stc_autanalog_sar_seq_tab_lp_t::nextAction
                                                                     *   is set to GO_TO_ENTRY_ADDRESS or STOP.
                                                                     *   \note This trigger does NOT indicate that the SAR data
                                                                     *   has been written to the FIFO
                                                                     *   (use the FIFO level triggers instead). */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL1   =       1UL << 20U, /**< The FIFO Level 1 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs
                                                                     *   (cy_stc_autanalog_fifo_cfg_t::split
                                                                     *   is not equal to CY_AUTANALOG_FIFO_SPLIT1). */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_SAR_RANGE0    =       1UL << 21U, /**< The SAR, range 0 */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_SAR_RANGE1    =       1UL << 22U, /**< The SAR, range 1 */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_SAR_RANGE2    =       1UL << 23U, /**< The SAR, range 2 */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_SAR_RANGE3    =       1UL << 24U, /**< The SAR, range 3 */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL2   =       1UL << 25U, /**< The FIFO Level 2 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL3   =       1UL << 26U, /**< The FIFO Level 3 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL4   =       1UL << 27U, /**< The FIFO Level 4 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL5   =       1UL << 28U, /**< The FIFO Level 5 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL6   =       1UL << 29U, /**< The FIFO Level 6 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_FIFO_LEVEL7   =       1UL << 30U, /**< The FIFO Level 7 trigger.
                                                                     *   It is similar to FIFO Level 0 trigger.
                                                                     *   \note This trigger is only generated if the FIFO
                                                                     *   is configured for multiple FIFOs. */
    CY_AUTANALOG_AC_OUT_TRIG_MASK_AC            = ((int32_t)(1UL << 31U)), /**< The AC trigger.
                                                                     *   This trigger is set by the AC
                                                                     *   whenever executing a state with
                                                                     *   cy_stc_autanalog_stt_ac_t::trigInt = true. */
} cy_en_autanalog_ac_out_trigger_mask_t;


/**
* The AC clock source for wake-up Timer, see \ref cy_stc_autanalog_timer_t::clkSrc,
* for more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_TIMER_CLK_LP = 0UL, /**< The Timer clocked from CLK_LPOSC (nominally 4.096MHz) */
    CY_AUTANALOG_TIMER_CLK_LF = 1UL, /**< The Timer clocked from CLK_LF (nominally 32kHz) */

