PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_autanalog_ac_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_AC_LoadConfig
****************************************************************************//**
*
* Configures the AC per provided settings.
*
* \param acCfg
* Pointer to a structure containing configuration data for the AC,
* \ref cy_stc_autanalog_ac_t.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_AC_LoadConfig(const cy_stc_autanalog_ac_t * acCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_StartAutonomousControl
****************************************************************************//**
*
* Enables the AC for operation.
* \note This function is applicable while the AC is in STOPPED or PAUSED state.
* See \ref cy_stc_autanalog_state_ac_t for more details.
* By default, the AC starts running from State 0.
* The \ref Cy_AutAnalog_OverrideControllerState can be used to overwrite
* the STT current state.
* \note The AC will stop whenever the following occurs:
* 1. The AC is disabled (\ref Cy_AutAnalog_Disable);
* 2. The Autonomous Analog is configured for HS mode
* (cy_stc_autanalog_state_t::lpModeEnabled is false) and the chip leaves an Active Mode.
*
*******************************************************************************/
void Cy_AutAnalog_StartAutonomousControl(void);


/*******************************************************************************
* Function Name: Cy_AutAnalog_PauseAutonomousControl
****************************************************************************//**
*
* Pauses the AC during operation. The state in the STT does not change.
* \note This field is used for debug purposes only.
*
* The AC waits for the present state to complete before pausing.
* If the present state cannot complete (i.e. the ACTION and CONDITION are programmed improperly),
* the AC will not pause. Do not use this command when executing an AC sleep state
* (ACTION is set to WAIT_FOR and CONDITION is set to WAKE_*).
*
* When the AC is paused, all AC registered conditions are cleared.
* This command is ignored if AC is already PAUSED or STOPPED,
* \ref cy_stc_autanalog_state_t::ac.
*
* \return
* The current state in the State Transition Table.
*
*******************************************************************************/
uint8_t Cy_AutAnalog_PauseAutonomousControl(void);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SingleStepAutonomousControl
****************************************************************************//**
*
* Executes the single-step in the STT.
* \note This field is used for debug purposes only.
*
* If the present state cannot complete (i.e. the ACTION and CONDITION are programmed improperly),
* the AC will not pause. Do not use this command when executing an AC sleep state
* (ACTION is set to WAIT_FOR and CONDITION is set to WAKE_*).
*
* When the AC is paused, all AC registered conditions are cleared.
* This command is ignored if AC is already PAUSED or STOPPED,
* \ref cy_stc_autanalog_state_t::ac.
*
*******************************************************************************/
void Cy_AutAnalog_SingleStepAutonomousControl(void);


/*******************************************************************************
* Function Name: Cy_AutAnalog_GetControllerState
****************************************************************************//**
*
* Provides the operating status of the AC.
*
* \warning If the AC state is RUNNING, the AHB cannot read or write the State Transition Table!
*
* \param ctrlState
* Pointer to a structure for receiving the current operating status.
*
* \return
* Status of execution, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_GetControllerState(cy_stc_autanalog_state_t * ctrlState);


/*******************************************************************************
* Function Name: Cy_AutAnalog_OverrideControllerState
****************************************************************************//**
*
* Override current state in the STT with new one.
*
* \note This command must never be executed when the AC state is RUNNING,
* \ref cy_stc_autanalog_state_t::ac.
*
* \param newState
* New state in the State Transition Table.
*
*******************************************************************************/
void Cy_AutAnalog_OverrideControllerState(uint8_t newState);


/*******************************************************************************
* Function Name: Cy_AutAnalog_RunControllerState
****************************************************************************//**
*
* Triggers the AC to override the current state and
* forces it to run from the STT new state.
*
* \note This command must never be executed when the AC state is RUNNING,
* \ref cy_stc_autanalog_state_t::ac.
*
* \param newState
* Jumping to the new state in the State Transition Table.
*
*******************************************************************************/
void Cy_AutAnalog_RunControllerState(uint8_t newState);


/*******************************************************************************
* Function Name: Cy_AutAnalog_IsBusy
****************************************************************************//**
*
* Check if the AC is currently executing (RUNNING or STOPPED/PAUSED).
*
* \return
* Operating status, returns FALSE if STOPPED or PAUSED and TRUE if RUNNING.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_AutAnalog_IsBusy(void)
{
    /* Get the AC status */
    return ((uint32_t)CY_AUTANALOG_AC_STATUS_RUNNING == _FLD2VAL(ACTRLR_STATUS_STATUS, AUTANALOG_AC_STATUS(ACTRLR_BASE)));
}


