PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ac.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_SetOutputTriggerMask
****************************************************************************//**
*
* Configures which bits of the mask register generate a trigger output.
*
* \param trigIdx
* The AC trigger register to initialize the out trigger.
* See \ref cy_en_autanalog_ac_out_trigger_idx_t.
*
* \param mask
* The mask of triggers allowed to be activated.
* Each bit of this mask enables the corresponding out trigger in the AC.
* See \ref cy_en_autanalog_ac_out_trigger_mask_t.
*
*******************************************************************************/
void Cy_AutAnalog_SetOutputTriggerMask(cy_en_autanalog_ac_out_trigger_idx_t trigIdx, cy_en_autanalog_ac_out_trigger_mask_t mask);


/*******************************************************************************
* Function Name: Cy_AutAnalog_GetOutputTriggerMask
****************************************************************************//**
*
* Returns the AC out trigger mask.
* Each bit of this mask enables the corresponding out trigger in the AC.
*
* \param trigIdx
* The AC trigger register to initialize the out trigger.
* See \ref cy_en_autanalog_ac_out_trigger_idx_t.
*
* \return
* The mask of triggers allowed to be activated.
* Each bit of this mask enables the corresponding out trigger in the AC.
* See \ref cy_en_autanalog_ac_out_trigger_mask_t.
*
*******************************************************************************/
cy_en_autanalog_ac_out_trigger_mask_t Cy_AutAnalog_GetOutputTriggerMask(cy_en_autanalog_ac_out_trigger_idx_t trigIdx);


/*******************************************************************************
* Function Name: Cy_AutAnalog_FwTrigger
****************************************************************************//**
*
* Sends a firmware trigger to the AC.
*
* \note The AC can be programmed to respond to the firmware trigger
* by programming a state with a CONDITION TR_LPPASS_IN*.
* Additionally, this event will force the AC to wake up.
* Hardware clears this bit when the Autonomous Controller acknowledges the trigger.
* The firmware trigger is also reset whenever the following occurs:
* 1. The AC is disabled (\ref Cy_AutAnalog_Disable);
* 2. The Autonomous Analog is configured for HS mode
* (cy_stc_autanalog_state_t::lpModeEnabled is false)
* and the chip leaves Active mode.
*
* \param triggNum
* The AC trigger register to initialize the FW trigger.
* See \ref cy_en_autanalog_fw_trigger_t.
*
*******************************************************************************/
void Cy_AutAnalog_FwTrigger(cy_en_autanalog_fw_trigger_t triggNum);


/*******************************************************************************
* Function Name: Cy_AutAnalog_DeepSleepCallback
****************************************************************************//**
*
* Changes the FIFO mode to write only before entering into Deep Sleep mode
* and restores it to write/read upon wake-up.
*
* \note Changing the FIFO mode applies only to the AC in LP mode.
*
* \param callbackParams
* Callback parameters, see \ref cy_stc_syspm_callback_params_t
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_AutAnalog_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);

/** \} group_autanalog_ac_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22LPPASS */

#endif /** !defined(CY_AUTANALOG_AC_H) */

/** \} group_autanalog_ac */

/* [] END OF FILE */
